Revit 2024 API
ScheduleField.Schedule Property
 The schedule that this field belongs to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ViewSchedule Schedule { get; }
Visual Basic
Public ReadOnly Property Schedule As ViewSchedule
	Get
Visual C++
public:
property ViewSchedule^ Schedule {
	ViewSchedule^ get ();
}
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace